In [6]:
import pandas as pd
import numpy as np

In [11]:
lista = [['BRASIL','BRASIL','BRASIL','ARGENTINA','ARGENTINA','ARGENTINA',],[2017,2018,2019,2017,2018,2019]]

In [12]:
tuplas = zip(*lista) # Serve para juntar os elementos de uma lista que contenha mais de uma lista dentro ((0,0),(1,1),...)

In [13]:
tuplas = list(tuplas)

In [14]:
tuplas

[('BRASIL', 2017),
 ('BRASIL', 2018),
 ('BRASIL', 2019),
 ('ARGENTINA', 2017),
 ('ARGENTINA', 2018),
 ('ARGENTINA', 2019)]

In [15]:
multi = pd.MultiIndex.from_tuples(tuplas) # Função que transforma em MultiIndex a tupla escolhida.

In [16]:
multi

MultiIndex([(   'BRASIL', 2017),
            (   'BRASIL', 2018),
            (   'BRASIL', 2019),
            ('ARGENTINA', 2017),
            ('ARGENTINA', 2018),
            ('ARGENTINA', 2019)],
           )

In [17]:
df1 = pd.DataFrame(data=np.random.randn(6,2),index=multi,columns=['EXP TRIGO', 'EXP ARROZ'])

In [18]:
df1

                EXP TRIGO  EXP ARROZ
BRASIL    2017  -0.201390   1.210494
          2018  -0.465098   1.875928
          2019  -0.101188   1.196727
ARGENTINA 2017  -0.470613   1.859459
          2018   0.972558  -0.205548
          2019  -0.071854   1.523369

In [23]:
df1.index.names = ['País','Ano'] # Colocar um nome nos indices do Dataframe

In [24]:
df1

                EXP TRIGO  EXP ARROZ
País      Ano
BRASIL    2017  -0.201390   1.210494
          2018  -0.465098   1.875928
          2019  -0.101188   1.196727
ARGENTINA 2017  -0.470613   1.859459
          2018   0.972558  -0.205548
          2019  -0.071854   1.523369

In [25]:
# Encontrando valores

In [26]:
df1['EXP ARROZ']

País       Ano
BRASIL     2017    1.210494
           2018    1.875928
           2019    1.196727
ARGENTINA  2017    1.859459
           2018   -0.205548
           2019    1.523369
Name: EXP ARROZ, dtype: float64

In [27]:
df1.loc['BRASIL']

      EXP TRIGO  EXP ARROZ
Ano
2017  -0.201390   1.210494
2018  -0.465098   1.875928
2019  -0.101188   1.196727

In [28]:
df1.xs(2017,level=1) # Função que retorna os valores de outras seções do Dataframe

           EXP TRIGO  EXP ARROZ
País
BRASIL     -0.201390   1.210494
ARGENTINA  -0.470613   1.859459

In [29]:
df1[0:5]

                EXP TRIGO  EXP ARROZ
País      Ano
BRASIL    2017  -0.201390   1.210494
          2018  -0.465098   1.875928
          2019  -0.101188   1.196727
ARGENTINA 2017  -0.470613   1.859459
          2018   0.972558  -0.205548

In [30]:
df1[['EXP TRIGO','EXP ARROZ']]

                EXP TRIGO  EXP ARROZ
País      Ano
BRASIL    2017  -0.201390   1.210494
          2018  -0.465098   1.875928
          2019  -0.101188   1.196727
ARGENTINA 2017  -0.470613   1.859459
          2018   0.972558  -0.205548
          2019  -0.071854   1.523369

In [31]:
# Vendo o Dataframe de outra maneira

In [33]:
df1.unstack()

          EXP TRIGO                     EXP ARROZ
Ano            2017      2018      2019      2017      2018      2019
País
ARGENTINA -0.470613  0.972558 -0.071854  1.859459 -0.205548  1.523369
BRASIL    -0.201390 -0.465098 -0.101188  1.210494  1.875928  1.196727

In [34]:
df2 = df1.unstack()

In [35]:
df2

          EXP TRIGO                     EXP ARROZ
Ano            2017      2018      2019      2017      2018      2019
País
ARGENTINA -0.470613  0.972558 -0.071854  1.859459 -0.205548  1.523369
BRASIL    -0.201390 -0.465098 -0.101188  1.210494  1.875928  1.196727

In [36]:
df2.xs(2017,axis=1,level=1)

           EXP TRIGO  EXP ARROZ
País
ARGENTINA  -0.470613   1.859459
BRASIL     -0.201390   1.210494